modules/common/src/test/resources/com/l7tech/common/resources/warehouseRequestMultipleTimestampSignatures.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ws="http://warehouse.acme.com/ws">
   <soapenv:Header><wsse:Security soapenv:mustUnderstand="1" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"><wsse:BinarySecurityToken EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary" ValueType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-x509-token-profile-1.0#X509v3" wsu:Id="X509-8CEE3E6352A474CC25152225818139222">MIICgDCCAWigAwIBAgIJALLt3UmjdE/SMA0GCSqGSIb3DQEBBQUAMDAxDjAMBgNVBAoTBU9BU0lTMR4wHAYDVQQDExVPQVNJUyBJbnRlcm9wIFRlc3QgQ0EwIBcNMTgwMzI2MjE1MzE2WhgPMjExODAzMDIyMTUzMTZaMEAxDjAMBgNVBAoTBU9BU0lTMSAwHgYDVQQLExdPQVNJUyBJbnRlcm9wIFRlc3QgQ2VydDEMMAoGA1UEAxMDQm9iMIGfMA0GCSqGSIb3DQEBAQUAA4GNADCBiQKBgQClABVkHkpmzwTEjeln58wz3S8pUNLjrmpIUZxKxgVQBQFqHrniLLpY27ZYq3G/C3f2/InHSz6ikIn3OyA5qm7o1GpWEYiBlZWT4OAWCSEjCOD74y2WqvPqJvkr2s/57ILoSR6rFgZudI95UIuNasWYap4TlV/llM2tDP+nQkTCjQIDAQABow8wDTALBgNVHQ8EBAMCBLAwDQYJKoZIhvcNAQEFBQADggEBAFUxuFvYk75cC1y90JTXFKt0sIkiUWvuTcUOsFOfHh93rzDC/im9NuQZ7izEjrENARbx6mYBZq4Qf/LYfgLySm2KPLg2X80yr9vnlBU4GiircdK9Rf6hy1cCSe1hz2Z2Gh45bo0fGgX8vLhXJ6c2lWo/LeR5H+PWhBSLBQm87TxlahFrUfM43cl33v4wmV5J+TYDrvp+90Cb3FrQWYfBfdVvCjyat9rlzUb0dc3oyMIheFUWuqidNNV16HMhE5gEg4eaLlgvLjLGTUf2cPyeS+b+6cuhzzjwZedfSszlENSRMPXzrXZm/2ZYM/xDyTA3HUFY09XXtTrXgeOyBUpVlmA=</wsse:BinarySecurityToken><ds:Signature Id="SIG-8CEE3E6352A474CC25152225818139225" xmlns:ds="http://www.w3.org/2000/09/xmldsig#"><ds:SignedInfo><ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"><ec:InclusiveNamespaces PrefixList="soapenv ws" xmlns:ec="http://www.w3.org/2001/10/xml-exc-c14n#"/></ds:CanonicalizationMethod><ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/><ds:Reference URI="#id-8CEE3E6352A474CC25152225818138120"><ds:Transforms><ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"><ec:InclusiveNamespaces PrefixList="ws" xmlns:ec="http://www.w3.org/2001/10/xml-exc-c14n#"/></ds:Transform></ds:Transforms><ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/><ds:DigestValue>W6YSFoWPhlnV29vocaTKsU7JxTk=</ds:DigestValue></ds:Reference><ds:Reference URI="#TS-8CEE3E6352A474CC25152225818137916"><ds:Transforms><ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"><ec:InclusiveNamespaces PrefixList="wsse soapenv ws" xmlns:ec="http://www.w3.org/2001/10/xml-exc-c14n#"/></ds:Transform></ds:Transforms><ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/><ds:DigestValue>VjUa/2MnKm78+k/L5Ow336AIFUY=</ds:DigestValue></ds:Reference></ds:SignedInfo><ds:SignatureValue>oCGQ/kr1HcFHHdnIuZpQF5bLyetlnuFAGbfSmsjcKL6e/NXyFtG0mSQ+yfNSI0IWE1uXqrUnlH76
qyWV2/0wOrFp/yy/jvx6Ah2GlNVXuDya1nZywupcoTl4SMhujiQLROb+AB2fZq71kz1/9B9s7EdE
CnHaZWqmCZVfukV/yhI=</ds:SignatureValue><ds:KeyInfo Id="KI-8CEE3E6352A474CC25152225818139223"><wsse:SecurityTokenReference wsu:Id="STR-8CEE3E6352A474CC25152225818139224"><wsse:Reference URI="#X509-8CEE3E6352A474CC25152225818139222" ValueType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-x509-token-profile-1.0#X509v3"/></wsse:SecurityTokenReference></ds:KeyInfo></ds:Signature><wsse:BinarySecurityToken EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary" ValueType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-x509-token-profile-1.0#X509v3" wsu:Id="X509-8CEE3E6352A474CC25152225818138117">MIICgjCCAWqgAwIBAgIJALLt3UmjdE/TMA0GCSqGSIb3DQEBBQUAMDAxDjAMBgNVBAoTBU9BU0lTMR4wHAYDVQQDExVPQVNJUyBJbnRlcm9wIFRlc3QgQ0EwIBcNMTgwMzI2MjMxNjIxWhgPMjExODAzMDIyMzE2MjFaMEIxDjAMBgNVBAoTBU9BU0lTMSAwHgYDVQQLExdPQVNJUyBJbnRlcm9wIFRlc3QgQ2VydDEOMAwGA1UEAxMFQWxpY2UwgZ8wDQYJKoZIhvcNAQEBBQADgY0AMIGJAoGBAIUJPCtG7JthGRmQ8G1iryHRwCaU7aBRNqPl5dakkUsyoZLQ/ZBp7pOor6PnP/8l2FwF39bT8cR2lo2CqQqZ2UE7lCVq0Iz210U8Z1I7BcZw/ucEFhYE3NBsrXmI1eMTe9hwdvqvCmN48SWK1T4LaeYNN+P+QUSnkSEm8MvFQMiPAgMBAAGjDzANMAsGA1UdDwQEAwIEsDANBgkqhkiG9w0BAQUFAAOCAQEAFFJdESl83b5ChMRW6xfJJsfvG+Hdi55Ppgz98gKgoYMewX4dGAbaELLxeGH1iWvtuvUjxW4jEBkoV5iVtKDVwwJElt/mOFTnTguhdd/OJYDnNtVQd+URvk6QnG8tAvoKQxqsp6DSrs81W/pWVXMXe3xektcfq+NlGl1ylbmsj+oFd+XfiZbKKfE9YU4Q9oGs48T70a4uvIRhyaswZlO1vu+QNHHss40mwrhZV9s1QEOV8+l1EiyornIOQLVX/mQoBY+2wh5I5G7IzZp6oWA+L578D5KI84Yh4xXKR5+1r4P1+yCDNxIO6J+Iyizb5cEEcaS25Qw6GMUuVd/KKYqUWw==</wsse:BinarySecurityToken><ds:Signature Id="SIG-8CEE3E6352A474CC25152225818138121" xmlns:ds="http://www.w3.org/2000/09/xmldsig#"><ds:SignedInfo><ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"><ec:InclusiveNamespaces PrefixList="soapenv ws" xmlns:ec="http://www.w3.org/2001/10/xml-exc-c14n#"/></ds:CanonicalizationMethod><ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/><ds:Reference URI="#id-8CEE3E6352A474CC25152225818138120"><ds:Transforms><ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"><ec:InclusiveNamespaces PrefixList="ws" xmlns:ec="http://www.w3.org/2001/10/xml-exc-c14n#"/></ds:Transform></ds:Transforms><ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/><ds:DigestValue>W6YSFoWPhlnV29vocaTKsU7JxTk=</ds:DigestValue></ds:Reference><ds:Reference URI="#TS-8CEE3E6352A474CC25152225818137916"><ds:Transforms><ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"><ec:InclusiveNamespaces PrefixList="wsse soapenv ws" xmlns:ec="http://www.w3.org/2001/10/xml-exc-c14n#"/></ds:Transform></ds:Transforms><ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/><ds:DigestValue>VjUa/2MnKm78+k/L5Ow336AIFUY=</ds:DigestValue></ds:Reference></ds:SignedInfo><ds:SignatureValue>OZ/pgOpFv8eBIM9AoZxe1oZpf73pcNE2jpteEH6z26xyORnYL45an0g6+2/tONjAUAihTPGIaHey
dyg1nzziYfS9qsJtG8Z6LiFWRHzEuphKigg9FMGnl07d9xpF70xh4YpKIlIS2TPwDAtDOUoEoPS3
x9/SUJg8BsVmPXPqWfU=</ds:SignatureValue><ds:KeyInfo Id="KI-8CEE3E6352A474CC25152225818138118"><wsse:SecurityTokenReference wsu:Id="STR-8CEE3E6352A474CC25152225818138119"><wsse:Reference URI="#X509-8CEE3E6352A474CC25152225818138117" ValueType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-x509-token-profile-1.0#X509v3"/></wsse:SecurityTokenReference></ds:KeyInfo></ds:Signature><wsu:Timestamp wsu:Id="TS-8CEE3E6352A474CC25152225818137916"><wsu:Created>2018-03-28T17:29:41.378Z</wsu:Created><wsu:Expires>2018-03-28T18:29:41.378Z</wsu:Expires></wsu:Timestamp></wsse:Security></soapenv:Header>
   <soapenv:Body wsu:Id="id-8CEE3E6352A474CC25152225818138120" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
      <ws:listProducts>
         <ws:delay>0</ws:delay>
      </ws:listProducts>
   </soapenv:Body>
</soapenv:Envelope>